/*
有一个神奇的口袋,总的容积是400,用这个口袋可以变出一些物品,这些物品的总体积必须是400。小蒜现在有n个想要得到的物品,每个物品的体积分别是a1,a2 ...... an。
小蒜可以从这些物品中选择一些,如果选出的物体的总体积是400,那么利用这个神奇的口袋,小蒜就可以得到这些物品。现在的问题是,小蒜有多少种不同的选择物品的方式。
输入格式
  输入的第一行是正整数n(1≤n≤200),表示不同的物品的数目。
  接下来的n行,每行有一个1到400之间的正整数,分别给出a1,a2 …… an的值。
输出格式
  输出不同的选择物品的方式的数目对10000取模的结果(因为结果可能很大,为了避免高精度计算,只要求对10000取模的结果)。
eg:
  in:
    3
    200
    200
    200
  out:
    3
*/
#include<iostream>
#include<vector>
using namespace std;
int main()
{
    int n;
    cin>>n;
    int i,j;
    vector<int>v(n);
    for(i=0;i<n;i++)
    {
        cin>>v[i];
    }
    vector<int>answer(401,0);
    answer[0]=1;
    for(i=0;i<n;i++)
    {
        for(j=400;j>=v[i];j--)
        {
            answer[j]=(answer[j]+answer[j-v[i]])%10000;
        }
    }
    cout<<answer[400];
    return 0;
}
